fix: Update Security guide
Signed-off-by: Taras Drozdovskyi <t.drozdovsky@samsung.com>
